Revit 2025 API
DimensionStyleType Enumeration
 An enumerated type containing possible style types of dimensions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DimensionStyleType
Public Enumeration DimensionStyleType
public enum class DimensionStyleType
type DimensionStyleType
Members
Member name | Value | Description
Linear | 0 |  Linear dimension.
Angular | 1 |  Angular dimension.
Radial | 2 |  Radial dimension.
ArcLength | 3 |  ArcLength dimension.
SpotElevation | 4 |  SpotElevation
SpotCoordinate | 5 |  SpotCoordinate
LinearFixed | 7 |  LinearFixed dimension, which is linear dimension whose direction is parallel to X or Y.
SpotSlope | 8 |  SpotSlope
Diameter | 9 |  Diameter dimension.
AlignmentStationLabel | 10 |  Alignment Station Label
See Also
Reference
Autodesk.Revit.DB Namespace